FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32n6_otgfs.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <unistd.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32n6_gpio.h"
#include "hardware/stm32n6_memorymap.h"
#include "hardware/stm32n6_rcc.h"
#include "stm32n6_otgfs.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define USBDEV_MAXPACKET         64   /* Full speed max packet size */

/* Register access macros */

#define stm32n6_getreg32(a)          getreg32(a)
#define stm32n6_putreg32(v,a)        putreg32(v,a)

/* Interrupt mask for device mode */

#define OTG_GINTMSK_DEVINT \
  (OTG_GINTMSK_USBRST | OTG_GINTMSK_ENUMDNEM | OTG_GINTMSK_IEPINT | \
   OTG_GINTMSK_OEPINT | OTG_GINTMSK_RXFLVLM | OTG_GINTMSK_USBSUSPM | \
   OTG_GINTMSK_WUIM)

/* EP0 state definitions */

#define EP0STATE_IDLE              0
#define EP0STATE_SETUP             1
#define EP0STATE_DATA              2
#define EP0STATE_SHORTREAD         3

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Represents one endpoint */

struct stm32n6_ep_s
{
  struct usbdev_ep_s      ep;        /* USB device endpoint */
  struct stm32n6_usbdev_s *dev;      /* Driver instance */
  uint8_t                 eptype;    /* Endpoint type */
  uint8_t                 epnum;     /* Endpoint number (0-3) */
  uint8_t                 inuse;     /* Non-zero if endpoint is in use */
  uint16_t                maxpacketsize; /* Maximum packet size */
  uint8_t                 stalled;   /* 1: Endpoint is stalled */
  struct stm32n6_req_s   *head;      /* Head of request queue */
  struct stm32n6_req_s   *tail;      /* Tail of request queue */
};

/* Represents one request on an endpoint */

struct stm32n6_req_s
{
  struct usbdev_req_s     req;       /* Standard USB request */
  struct stm32n6_ep_s    *ep;        /* Bound endpoint */
  struct stm32n6_req_s   *flink;     /* Next request in queue */
};

/* Container for a device instance */

struct stm32n6_usbdev_s
{
  struct usbdev_s         usbdev;    /* USB device */
  uint32_t                base;      /* Base address of registers */
  uint8_t                 attached;  /* TRUE: device is attached */
  uint8_t                 suspended; /* TRUE: device is suspended */
  uint8_t                 selfpowered; /* TRUE: device is self-powered */
  uint8_t                 addressed; /* TRUE: device is addressed */
  uint8_t                 configured; /* TRUE: device is configured */
  uint8_t                 setaddress; /* New device address */
  uint8_t                 ep0state;  /* EP0 state */
  uint8_t                 neps;      /* Number of endpoints */
  struct stm32n6_ep_s     epin[STM32N6_OTGFS_NENDPOINTS];   /* IN endpoints */
  struct stm32n6_ep_s     epout[STM32N6_OTGFS_NENDPOINTS];  /* OUT endpoints */
  struct stm32n6_req_s    ep0req;    /* EP0 request structure */
  struct stm32n6_ep_s     ep0;       /* EP0 endpoint structure */
  uint32_t                rxflen;    /* Size of RX FIFO */
  uint32_t                nptxflen;  /* Size of non-periodic TX FIFO */
  uint32_t                ptxflen;   /* Size of periodic TX FIFO */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register access */

static inline uint32_t stm32n6_otg_getreg(uint32_t addr);
static inline void stm32n6_otg_putreg(uint32_t val, uint32_t addr);

/* Request list operations */

static void stm32n6_rqcancel(struct stm32n6_ep_s *privep, 
                             struct stm32n6_req_s *privreq, int status);

/* Endpoint operations */

static int stm32n6_epconfigure(struct usbdev_ep_s *ep, 
                               const struct usb_epdesc_s *desc);
static int stm32n6_epdisable(struct usbdev_ep_s *ep);
static struct usbdev_req_s *stm32n6_epallocreq(struct usbdev_ep_s *ep);
static void stm32n6_epfreereq(struct usbdev_ep_s *ep, 
                              struct usbdev_req_s *req);
static int stm32n6_epsubmit(struct usbdev_ep_s *ep, 
                            struct usbdev_req_s *req);
static int stm32n6_epcancel(struct usbdev_ep_s *ep, 
                            struct usbdev_req_s *req);
static int stm32n6_epstall(struct usbdev_ep_s *ep, bool resume);

/* USB device operation methods */

static int stm32n6_drvrbind(struct usbdev_s *dev, 
                            struct usbdevdriver_s *driver);
static int stm32n6_drvrunbind(struct usbdev_s *dev, 
                              struct usbdevdriver_s *driver);
static int stm32n6_drvrsetup(struct usbdev_s *dev, 
                             const struct usb_ctrlreq_s *ctrl);
static ssize_t stm32n6_drvrtrace(struct usbdev_s *dev, 
                                 int ntrace, bool verbose);

/* USB controller operations */

static void stm32n6_usbreset(struct stm32n6_usbdev_s *priv);
static void stm32n6_flush_rx(struct stm32n6_usbdev_s *priv);
static void stm32n6_flush_tx(struct stm32n6_usbdev_s *priv, uint32_t txfnum);
static void stm32n6_setaddress(struct stm32n6_usbdev_s *priv, uint16_t address);
static void stm32n6_enableep(struct stm32n6_usbdev_s *priv, int epno);
static void stm32n6_disableep(struct stm32n6_usbdev_s *priv, int epno);
static void stm32n6_seteptype(struct stm32n6_usbdev_s *priv, int epno, uint8_t eptype);
static void stm32n6_setmps(struct stm32n6_usbdev_s *priv, int epno, uint16_t mps);

/* FIFO management */

static void stm32n6_initfifo(struct stm32n6_usbdev_s *priv);

/* Interrupt handling */

static int stm32n6_usbinterrupt(int irq, void *context, void *arg);

/* Power management */

static int stm32n6_usbpullup(struct usbdev_s *dev, bool enable);
static int stm32n6_usbsuspend(struct usbdev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

