FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
static const struct usbdev_ops_s g_usbdev_ops =
{
  .ep_configure   = stm32n6_epconfigure,
  .ep_disable    = stm32n6_epdisable,
  .ep_allocreq   = stm32n6_epallocreq,
  .ep_freereq    = stm32n6_epfreereq,
  .ep_submit     = stm32n6_epsubmit,
  .ep_cancel     = stm32n6_epcancel,
  .ep_stall      = stm32n6_epstall,
  .pullup        = stm32n6_usbpullup,
  .suspend       = stm32n6_usbsuspend,
  .resume        = NULL,
  .wakeup        = NULL,
  .selfpowered   = NULL,
  .setaddress    = NULL,
};

static struct stm32n6_usbdev_s g_otgdev;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32n6_otg_getreg/stm32n6_otg_putreg
 ****************************************************************************/

static inline uint32_t stm32n6_otg_getreg(uint32_t addr)
{
  return getreg32(addr);
}

static inline void stm32n6_otg_putreg(uint32_t val, uint32_t addr)
{
  putreg32(val, addr);
}

/****************************************************************************
 * Name: stm32n6_rqcancel
 ****************************************************************************/

static void stm32n6_rqcancel(struct stm32n6_ep_s *privep, 
                             struct stm32n6_req_s *privreq, int status)
{
  struct stm32n6_usbdev_s *priv = privep->dev;

  usbdbg("EP%d: cancelling req=%p\n", privep->epnum, privreq);

  /* Remove the request from the endpoint's queue */

  if (privep->head == privreq)
    {
      /* Removing the first request in the queue */

      privep->head = privreq->flink;
      if (privep->tail == privreq)
        {
          /* This is also the last request in the queue */

          privep->tail = NULL;
        }
    }
  else
    {
      /* Remove from somewhere in the middle of the queue */

      struct stm32n6_req_s *prev = privep->head;
      while (prev && prev->flink != privreq)
        {
          prev = prev->flink;
        }

      if (prev)
        {
          prev->flink = privreq->flink;
          if (privep->tail == privreq)
            {
              privep->tail = prev;
            }
        }
    }

  /* Return the request to the free list */

  privreq->flink = priv->free;
  priv->free = privreq;

  /* Callback to the request */

  usbdbg("Callback req=%p status=%d\n", privreq, status);
  if (privreq->req.callback)
    {
      privreq->req.callback(&privep->ep, &privreq->req, status);
    }
}

/****************************************************************************
 * Name: stm32n6_epconfigure
 ****************************************************************************/

static int stm32n6_epconfigure(struct usbdev_ep_s *ep, 
                               const struct usb_epdesc_s *desc)
{
  struct stm32n6_ep_s *privep = (struct stm32n6_ep_s *)ep;
  struct stm32n6_usbdev_s *priv = privep->dev;
  uint32_t regaddr;
  uint32_t regval;
  int epno;

  usbdbg("ep=%p desc=%p\n", ep, desc);

  if (!desc || !privep || !priv)
    {
      return -EINVAL;
    }

  /* Extract endpoint number */

  epno = USB_EPNO(desc->bEndpointAddress);
  if (epno >= STM32N6_OTGFS_NENDPOINTS)
    {
      return -EINVAL;
    }

  /* Set endpoint configuration */

  privep->eptype = desc->bmAttributes & USB_EPTYPE_MASK;
  privep->maxpacketsize = le16toh(desc->wMaxPacketSize);
  privep->epnum = epno;

  /* Configure endpoint register based on direction */

  if (USB_EPDIR(desc->bEndpointAddress) == USB_EPDIR_IN)
    {
      /* Configure IN endpoint */
      regaddr = STM32_OTG_DIEPCTL_OFFSET(epno) + priv->base;
      regval = stm32n6_getreg32(regaddr);

      /* Clear existing configuration */
      regval &= ~(OTG_DEPCTL_MPSIZ_MASK | OTG_DEPCTL_EPTYP_MASK | OTG_DEPCTL_USBAEP);
      
      /* Set max packet size */
      regval |= (privep->maxpacketsize & 0x7FF) << OTG_DEPCTL_MPSIZ_SHIFT;
      
      /* Set endpoint type */
      switch (privep->eptype)
        {
          case USB_EPTYPE_ISOC:
            regval |= OTG_DEPCTL_EPTYP_ISO;
            break;
          case USB_EPTYPE_BULK:
            regval |= OTG_DEPCTL_EPTYP_BULK;
            break;
          case USB_EPTYPE_INTR:
            regval |= OTG_DEPCTL_EPTYP_INTR;
            break;
          default:
            regval |= OTG_DEPCTL_EPTYP_CTRL;
            break;
        }

      /* Set USB active endpoint */
      regval |= OTG_DEPCTL_USBAEP;
      
      /* Set endpoint number */
      regval |= (epno << 22) & (0xF << 22);
      
      stm32n6_putreg32(regval, regaddr);
    }
  else
    {
      /* Configure OUT endpoint */
      regaddr = STM32_OTG_DOEPCTL_OFFSET(epno) + priv->base;
      regval = stm32n6_getreg32(regaddr);

      /* Clear existing configuration */
      regval &= ~(OTG_DEPCTL_MPSIZ_MASK | OTG_DEPCTL_EPTYP_MASK);
      
      /* Set max packet size */
      regval |= (privep->maxpacketsize & 0x7FF) << OTG_DEPCTL_MPSIZ_SHIFT;
      
      /* Set endpoint type */
      switch (privep->eptype)
        {
          case USB_EPTYPE_ISOC:
            regval |= OTG_DEPCTL_EPTYP_ISO;
            break;
          case USB_EPTYPE_BULK:
            regval |= OTG_DEPCTL_EPTYP_BULK;
            break;
          case USB_EPTYPE_INTR:
            regval |= OTG_DEPCTL_EPTYP_INTR;
            break;
          default:
            regval |= OTG_DEPCTL_EPTYP_CTRL;
            break;
        }

      /* Set USB active endpoint */
      regval |= OTG_DEPCTL_USBAEP;
      
      /* Set endpoint number */
      regval |= (epno << 22) & (0xF << 22);
      
      stm32n6_putreg32(regval, regaddr);
    }

  /* Mark endpoint as in use */
  privep->inuse = 1;

  return OK;
}

/****************************************************************************
 * Name: stm32n6_epdisable
 ****************************************************************************/

static int stm32n6_epdisable(struct usbdev_ep_s *ep)
{
  struct stm32n6_ep_s *privep = (struct stm32n6_ep_s *)ep;
  struct stm32n6_usbdev_s *priv;
  irqstate_t flags;
  uint32_t regaddr;
  uint32_t regval;

  usbdbg("ep=%p\n", ep);
  if (!ep || !privep)
    {
      return -EINVAL;
    }

  priv = (struct stm32n6_usbdev_s *)privep->dev;
  if (!priv)
    {
      return -EINVAL;
    }

  flags = enter_critical_section();

  /* Disable endpoint */
  if (privep->epnum == 0 || (privep->epnum > 0 && privep->epnum < 4))
    {
      if (USB_EPDIR(privep->ep.ep_in) == USB_EPDIR_IN)
        {
          regaddr = STM32_OTG_DIEPCTL_OFFSET(privep->epnum) + priv->base;
          regval = stm32n6_getreg32(regaddr);
          regval |= OTG_DEPCTL_EPDIS;
          stm32n6_putreg32(regval, regaddr);
        }
      else
        {
          regaddr = STM32_OTG_DOEPCTL_OFFSET(privep->epnum) + priv->base;
          regval = stm32n6_getreg32(regaddr);
          regval |= OTG_DEPCTL_EPDIS;
          stm32n6_putreg32(regval, regaddr);
        }
    }

  /* Cancel all queued transfers */
  while (privep->head)
    {
      stm32n6_rqcancel(privep, privep->head, -ESHUTDOWN);
    }

