FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
  /* Mark endpoint as no longer in use */
  privep->inuse = 0;
  privep->stalled = 0;

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32n6_epallocreq
 ****************************************************************************/

static struct usbdev_req_s *stm32n6_epallocreq(struct usbdev_ep_s *ep)
{
  struct stm32n6_req_s *privreq;

  usbdbg("ep=%p\n", ep);
  privreq = (struct stm32n6_req_s *)kmm_malloc(sizeof(struct stm32n6_req_s));
  if (!privreq)
    {
      usbdbg("Failed to allocate request\n");
      return NULL;
    }

  memset(privreq, 0, sizeof(struct stm32n6_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: stm32n6_epfreereq
 ****************************************************************************/

static void stm32n6_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct stm32n6_req_s *privreq = (struct stm32n6_req_s *)req;
  DEBUGASSERT(privreq);

  usbdbg("ep=%p req=%p\n", ep, req);
  kmm_free(privreq);
}

/****************************************************************************
 * Name: stm32n6_epsubmit
 ****************************************************************************/

static int stm32n6_epsubmit(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct stm32n6_ep_s *privep = (struct stm32n6_ep_s *)ep;
  struct stm32n6_usbdev_s *priv;
  struct stm32n6_req_s *privreq;
  irqstate_t flags;
  uint32_t regaddr;
  uint32_t regval;
  uint32_t xfrsize;

  usbdbg("ep=%p req=%p\n", ep, req);
  if (!req || !ep || !privep || !privep->dev)
    {
      return -EINVAL;
    }

  usbdbg("len=%d flags=%02x\n", req->len, req->flags);

  priv = (struct stm32n6_usbdev_s *)privep->dev;
  privreq = (struct stm32n6_req_s *)req;

  if (!req->callback || !req->buf)
    {
      usbdbg("Invalid request\n");
      return -EINVAL;
    }

  flags = enter_critical_section();

  /* Add the request to the endpoint's queue */

  privreq->flink = NULL;
  privreq->ep = privep;

  if (!privep->head)
    {
      /* First request in the queue */

      privep->head = privreq;
      privep->tail = privreq;

      /* Configure transfer in hardware */
      if (USB_EPDIR(ep->ep_in) == USB_EPDIR_IN)
        {
          /* IN endpoint - data goes from memory to device */
          regaddr = STM32_OTG_DIEPTSIZ_OFFSET(privep->epnum) + priv->base;
          xfrsize = MIN(req->len, privep->maxpacketsize);
          
          regval = stm32n6_getreg32(regaddr);
          regval &= ~OTG_DEPTSIZ_XFRSIZ_MASK;
          regval |= xfrsize & OTG_DEPTSIZ_XFRSIZ_MASK;
          
          /* Set packet count */
          uint32_t pktcnt = (req->len + privep->maxpacketsize - 1) / privep->maxpacketsize;
          regval &= ~OTG_DEPTSIZ_PKTCNT_MASK;
          regval |= (pktcnt << OTG_DEPTSIZ_PKTCNT_SHIFT) & OTG_DEPTSIZ_PKTCNT_MASK;
          
          stm32n6_putreg32(regval, regaddr);

          /* Enable endpoint */
          regaddr = STM32_OTG_DIEPCTL_OFFSET(privep->epnum) + priv->base;
          regval = stm32n6_getreg32(regaddr);
          regval |= OTG_DEPCTL_EPENA | OTG_DEPCTL_CNAK;
          stm32n6_putreg32(regval, regaddr);
        }
      else
        {
          /* OUT endpoint - data comes from device to memory */
          regaddr = STM32_OTG_DOEPTSIZ_OFFSET(privep->epnum) + priv->base;
          xfrsize = MIN(req->len, privep->maxpacketsize);
          
          regval = stm32n6_getreg32(regaddr);
          regval &= ~OTG_DEPTSIZ_XFRSIZ_MASK;
          regval |= xfrsize & OTG_DEPTSIZ_XFRSIZ_MASK;
          
          /* Set packet count */
          uint32_t pktcnt = (req->len + privep->maxpacketsize - 1) / privep->maxpacketsize;
          regval &= ~OTG_DEPTSIZ_PKTCNT_MASK;
          regval |= (pktcnt << OTG_DEPTSIZ_PKTCNT_SHIFT) & OTG_DEPTSIZ_PKTCNT_MASK;
          
          stm32n6_putreg32(regval, regaddr);

          /* Enable endpoint */
          regaddr = STM32_OTG_DOEPCTL_OFFSET(privep->epnum) + priv->base;
          regval = stm32n6_getreg32(regaddr);
          regval |= OTG_DEPCTL_EPENA | OTG_DEPCTL_CNAK;
          stm32n6_putreg32(regval, regaddr);
        }
    }
  else
    {
      /* Add to the end of the queue */
      privep->tail->flink = privreq;
      privep->tail = privreq;
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32n6_drvrsetup
 ****************************************************************************/

static int stm32n6_drvrsetup(struct usbdev_s *dev, const struct usb_ctrlreq_s *ctrl)
{
  struct stm32n6_usbdev_s *priv = (struct stm32n6_usbdev_s *)dev;
  struct stm32n6_ep_s *privep;
  irqstate_t flags;
  int ret = -EIO;

  usbdbg("ctrl=%p\n", ctrl);
  usbdbg("type=%02x req=%02x value=%04x index=%04x len=%04x\n",
         ctrl->type, ctrl->req, ctrl->value, ctrl->index, ctrl->len);

  flags = enter_critical_section();

  /* Forward to the class driver */
  if (priv->usbdev.driver && priv->usbdev.driver->ops->setup)
    {
      ret = priv->usbdev.driver->ops->setup(priv->usbdev.driver, ctrl);
    }

  /* If SETUP was not processed by class driver, handle standard requests */
  if (ret == -EIO)
    {
      /* Handle standard requests */
      switch (ctrl->req)
        {
          case USB_REQ_GETDESCRIPTOR:
            {
              uint8_t type = (ctrl->value >> 8) & 0xff;
              uint8_t index = ctrl->value & 0xff;

              usbdbg("GET_DESCRIPTOR type=%d index=%d\n", type, index);

              switch (type)
                {
                  case USB_CONFIGURATION_DESCRIPTOR_TYPE:
                  case USB_DEVICE_DESCRIPTOR_TYPE:
                  case USB_STRING_DESCRIPTOR_TYPE:
                    /* Forward to class driver */
                    break;
                  default:
                    break;
                }
              break;
            }

          case USB_REQ_SETADDRESS:
            {
              uint16_t address = ctrl->value & 0x7f;
              usbdbg("SET_ADDRESS address=%d\n", address);
              priv->setaddress = address;
              break;
            }

