FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
          case USB_REQ_SETCONFIGURATION:
            {
              uint8_t config = ctrl->value & 0xff;
              usbdbg("SET_CONFIG config=%d\n", config);
              priv->configured = (config != 0) ? 1 : 0;
              break;
            }

          case USB_REQ_SETFEATURE:
          case USB_REQ_CLEARFEATURE:
            {
              uint8_t recipient = ctrl->type & USB_REQ_RECIPIENT_MASK;
              uint16_t feature = ctrl->value;

              if (recipient == USB_REQ_RECIPIENT_ENDPOINT && feature == USB_FEATURE_ENDPOINT_HALT)
                {
                  uint8_t epno = USB_EPNO(ctrl->index);
                  uint8_t dir = USB_EPDIR(ctrl->index);

                  usbdbg("SET_FEATURE CLEAR_FEATURE ENDPOINT_HALT ep=%d dir=%d\n", epno, dir);
                  privep = dir == USB_EPDIR_IN ? &priv->epin[epno] : &priv->epout[epno];
                  
                  if (ctrl->req == USB_REQ_SETFEATURE)
                    {
                      stm32n6_epstall(&privep->ep, false);
                    }
                  else
                    {
                      stm32n6_epstall(&privep->ep, true);
                    }
                }
              break;
            }

          default:
            break;
        }
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: stm32n6_drvrbind
 ****************************************************************************/

static int stm32n6_drvrbind(struct usbdev_s *dev, struct usbdevdriver_s *driver)
{
  struct stm32n6_usbdev_s *priv = (struct stm32n6_usbdev_s *)dev;
  irqstate_t flags;

  usbdbg("dev=%p driver=%p\n", dev, driver);
  if (!driver || !dev || !priv)
    {
      return -EINVAL;
    }

  flags = enter_critical_section();

  /* Bind the class driver */
  priv->usbdev.driver = driver;

  /* Enable USB controller */
  stm32n6_usbpullup(dev, true);

  /* Perform driver bind callback */
  if (driver->ops->bind)
    {
      driver->ops->bind(driver, &priv->usbdev);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32n6_usbpullup
 ****************************************************************************/

static int stm32n6_usbpullup(struct usbdev_s *dev, bool enable)
{
  struct stm32n6_usbdev_s *priv = (struct stm32n6_usbdev_s *)dev;
  uint32_t regval;

  usbdbg("enable=%d\n", enable);
  
  if (enable)
    {
      /* Enable pull-up to connect device */
      regval = stm32n6_getreg32(priv->base + STM32_OTG_GCCFG_OFFSET);
      regval |= OTG_GCCFG_PWRDWN;  /* Power down disable */
      regval |= OTG_GCCFG_VBDEN;   /* Enable VBUS detection */
      stm32n6_putreg32(regval, priv->base + STM32_OTG_GCCFG_OFFSET);

      /* Start USB controller */
      regval = stm32n6_getreg32(priv->base + STM32_OTG_DCTL_OFFSET);
      regval &= ~OTG_DCTL_SDIS;    /* Soft disconnect */
      stm32n6_putreg32(regval, priv->base + STM32_OTG_DCTL_OFFSET);
    }
  else
    {
      /* Disable pull-up to disconnect device */
      regval = stm32n6_getreg32(priv->base + STM32_OTG_DCTL_OFFSET);
      regval |= OTG_DCTL_SDIS;     /* Soft disconnect */
      stm32n6_putreg32(regval, priv->base + STM32_OTG_DCTL_OFFSET);

      regval = stm32n6_getreg32(priv->base + STM32_OTG_GCCFG_OFFSET);
      regval &= ~OTG_GCCFG_PWRDWN; /* Power down enable */
      stm32n6_putreg32(regval, priv->base + STM32_OTG_GCCFG_OFFSET);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32n6_usbreset
 ****************************************************************************/

static void stm32n6_usbreset(struct stm32n6_usbdev_s *priv)
{
  uint32_t regval;
  int i;

  usbdbg("Reset USB\n");

  /* Soft disconnect device */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_DCTL_OFFSET);
  regval |= OTG_DCTL_SDIS;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCTL_OFFSET);

  /* Flush TX and RX FIFOs */
  stm32n6_flush_rx(priv);

  for (i = 0; i < STM32N6_OTGFS_NENDPOINTS; i++)
    {
      stm32n6_flush_tx(priv, i);
    }

  /* Clear device address */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_DCFG_OFFSET);
  regval &= ~OTG_DCFG_DAD_MASK;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCFG_OFFSET);

  /* Configure device as full-speed */
  regval |= OTG_DCFG_DSPD_FS_PHY_48MHZ;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCFG_OFFSET);

  /* Disable soft disconnect */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_DCTL_OFFSET);
  regval &= ~OTG_DCTL_SDIS;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCTL_OFFSET);

  /* Reset device state */
  priv->addressed = 0;
  priv->configured = 0;
  priv->setaddress = 0;

  /* Initialize endpoints */
  for (i = 1; i < STM32N6_OTGFS_NENDPOINTS; i++)
    {
      stm32n6_disableep(priv, i);
    }
}

/****************************************************************************
 * Name: stm32n6_flush_rx/stm32n6_flush_tx
 ****************************************************************************/

static void stm32n6_flush_rx(struct stm32n6_usbdev_s *priv)
{
  uint32_t regval;

  regval = OTG_GRSTCTL_RXFFLSH;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GRSTCTL_OFFSET);

  /* Wait for flush to complete */
  while ((stm32n6_getreg32(priv->base + STM32_OTG_GRSTCTL_OFFSET) & OTG_GRSTCTL_RXFFLSH) != 0);
}

static void stm32n6_flush_tx(struct stm32n6_usbdev_s *priv, uint32_t txfnum)
{
  uint32_t regval;

  regval = OTG_GRSTCTL_TXFFLSH | ((txfnum & 0x1F) << 6);
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GRSTCTL_OFFSET);

  /* Wait for flush to complete */
  while ((stm32n6_getreg32(priv->base + STM32_OTG_GRSTCTL_OFFSET) & OTG_GRSTCTL_TXFFLSH) != 0);
}

/****************************************************************************
 * Name: stm32n6_initfifo
 ****************************************************************************/

static void stm32n6_initfifo(struct stm32n6_usbdev_s *priv)
{
  uint32_t regval;

