FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
  /* Set RX FIFO size */
  regval = STM32N6_OTGFS_RXFIFO_SIZE;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GRXFIFOSIZ_OFFSET);

  /* Set endpoint 0 TX FIFO size and offset */
  regval = (STM32N6_OTGFS_NPTXFIFO_SIZE << 16) | STM32N6_OTGFS_RXFIFO_SIZE; /* Size = 128, Offset = 128 */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GNPTXFIFOSIZ_OFFSET);

  /* Set other TX FIFOs if needed */
}

/****************************************************************************
 * Name: stm32n6_usbinterrupt
 ****************************************************************************/

static int stm32n6_usbinterrupt(int irq, void *context, void *arg)
{
  struct stm32n6_usbdev_s *priv = (struct stm32n6_usbdev_s *)arg;
  uint32_t intsts;
  uint32_t intmask;
  uint32_t epint;
  int i;

  /* Get interrupt status */
  intsts = stm32n6_getreg32(priv->base + STM32_OTG_GINTSTS_OFFSET);
  intmask = stm32n6_getreg32(priv->base + STM32_OTG_GINTMSK_OFFSET);

  intsts &= intmask;

  /* Clear interrupts */
  stm32n6_putreg32(intsts, priv->base + STM32_OTG_GINTSTS_OFFSET);

  usbvdbg("intsts=%08x\n", intsts);

  /* USB reset */
  if (intsts & OTG_GINTSTS_USBRST)
    {
      usbvdbg("USB Reset\n");
      stm32n6_usbreset(priv);
      stm32n6_initfifo(priv);
      stm32n6_putreg32(0xFF, priv->base + STM32_OTG_DIEPMSK_OFFSET);
      stm32n6_putreg32(0xFF, priv->base + STM32_OTG_DOEPMSK_OFFSET);
      return OK;
    }

  /* Start of frame */
  if (intsts & OTG_GINTSTS_SOF)
    {
      usbvdbg("SOF\n");
      /* Clear SOF interrupt */
      stm32n6_putreg32(OTG_GINTSTS_SOF, priv->base + STM32_OTG_GINTSTS_OFFSET);
    }

  /* Enumeration done */
  if (intsts & OTG_GINTSTS_ENUMDNE)
    {
      usbvdbg("Enumeration Done\n");
      /* Clear enum done interrupt */
      stm32n6_putreg32(OTG_GINTSTS_ENUMDNE, priv->base + STM32_OTG_GINTSTS_OFFSET);
      
      /* Set up default EP0 */
      struct stm32n6_ep_s *ep0 = &priv->epin[0];
      ep0->epnum = 0;
      ep0->maxpacketsize = 64;
      ep0->eptype = USB_EPTYPE_CTRL;
    }

  /* Resume */
  if (intsts & OTG_GINTSTS_WKUINT)
    {
      usbvdbg("Resume\n");
      stm32n6_putreg32(OTG_GINTSTS_WKUINT, priv->base + STM32_OTG_GINTSTS_OFFSET);
      priv->suspended = false;
    }

  /* Suspend */
  if (intsts & OTG_GINTSTS_USBSUSP)
    {
      usbvdbg("Suspend\n");
      stm32n6_putreg32(OTG_GINTSTS_USBSUSP, priv->base + STM32_OTG_GINTSTS_OFFSET);
      priv->suspended = true;
    }

  /* RX FIFO not empty */
  if (intsts & OTG_GINTSTS_RXFLVL)
    {
      uint32_t grxsts;
      uint8_t epnum;
      uint8_t pktsts;
      uint16_t bcnt;
      struct stm32n6_ep_s *privep;

      /* Read RX status */
      grxsts = stm32n6_getreg32(priv->base + STM32_OTG_GRXSTSR_OFFSET);
      epnum = (grxsts >> 0) & 0xF;
      pktsts = (grxsts >> 17) & 0xF;
      bcnt = (grxsts >> 4) & 0x7FF;

      usbvdbg("RXSTS ep=%d pktsts=%d bcnt=%d\n", epnum, pktsts, bcnt);

      /* Pop RX status */
      stm32n6_putreg32(grxsts, priv->base + STM32_OTG_GRXSTSP_OFFSET);

      switch (pktsts)
        {
          case 0x01:  /* Global OUT NAK */
            break;

          case 0x02:  /* Out received */
            {
              if (epnum == 0 && bcnt > 0)
                {
                  /* EP0 OUT packet */
                  privep = &priv->epout[0];
                  if (privep->head)
                    {
                      /* Copy data to request buffer */
                      uint32_t *src = (uint32_t *)(priv->base + STM32_OTG_DFIFO_OFFSET(0));
                      uint32_t *dst = (uint32_t *)privep->head->req.buf;
                      int word_count = (bcnt + 3) / 4;

                      for (int j = 0; j < word_count; j++)
                        {
                          *dst++ = stm32n6_getreg32((uint32_t)src++);
                        }

                      privep->head->req.actual = bcnt;

                      /* Complete the request */
                      stm32n6_rqcancel(privep, privep->head, 0);
                    }
                }
              break;
            }

          case 0x03:  /* Out complete */
            break;

          case 0x04:  /* Setup received */
            {
              if (epnum == 0)
                {
                  struct usb_ctrlreq_s ctrlreq;
                  uint32_t *src = (uint32_t *)(priv->base + STM32_OTG_DFIFO_OFFSET(0));

                  /* Pop SETUP packet */
                  ((uint32_t *)&ctrlreq)[0] = stm32n6_getreg32((uint32_t)src++);
                  ((uint32_t *)&ctrlreq)[1] = stm32n6_getreg32((uint32_t)src++);

                  usbvdbg("SETUP type=%02x req=%02x\n", ctrlreq.type, ctrlreq.req);

                  /* Process SETUP packet */
                  if (priv->usbdev.driver)
                    {
                      int ret = stm32n6_drvrsetup(&priv->usbdev, &ctrlreq);
                      if (ret < 0)
                        {
                          /* Stall EP0 if SETUP wasn't handled */
                          uint32_t regval = stm32n6_getreg32(priv->base + STM32_OTG_DIEPCTL_OFFSET(0));
                          regval |= OTG_DEPCTL_STALL;
                          stm32n6_putreg32(regval, priv->base + STM32_OTG_DIEPCTL_OFFSET(0));
                        }
                    }
                }
              break;
            }

          case 0x06:  /* Setup complete */
            {
              if (epnum == 0)
                {
                  /* EP0 SETUP packet - pop 8 bytes (2 transactions) */
                  for (int j = 0; j < 2; j++)
                    {
                      (void)stm32n6_getreg32(priv->base + STM32_OTG_DFIFO_OFFSET(0));
                    }
                }
              break;
            }

          default:
            break;
        }
    }

  /* IN endpoint interrupt */
  if (intsts & OTG_GINTSTS_IEPINT)
    {
      epint = (stm32n6_getreg32(priv->base + STM32_OTG_DAINT_OFFSET) & 0xFFFF);
      for (i = 0; i < STM32N6_OTGFS_NENDPOINTS && epint; i++, epint >>= 1)
        {
          if ((epint & 1) == 0)
            {
              continue;
            }

          /* Check IN endpoint interrupt status */
          uint32_t diepint = stm32n6_getreg32(priv->base + STM32_OTG_DIEPINT_OFFSET(i));
          uint32_t diepmsk = stm32n6_getreg32(priv->base + STM32_OTG_DIEPMSK_OFFSET);

