FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32n6/stm32n6_otgfs.c
          usbvdbg("EP%d IN intsts=%08x\n", i, diepint);

          if (diepint & diepmsk)
            {
              /* Clear interrupt flags */
              stm32n6_putreg32(diepint, priv->base + STM32_OTG_DIEPINT_OFFSET(i));

              if (diepint & (1 << 0))  /* Transfer complete */
                {
                  struct stm32n6_ep_s *privep = &priv->epin[i];

                  if (privep->head)
                    {
                      /* Complete the request */
                      stm32n6_rqcancel(privep, privep->head, 0);
                    }
                }
            }
        }
    }

  /* OUT endpoint interrupt */
  if (intsts & OTG_GINTSTS_OEPINT)
    {
      epint = (stm32n6_getreg32(priv->base + STM32_OTG_DAINT_OFFSET) >> 16) & 0xFFFF;
      for (i = 0; i < STM32N6_OTGFS_NENDPOINTS && epint; i++, epint >>= 1)
        {
          if ((epint & 1) == 0)
            {
              continue;
            }

          /* Check OUT endpoint interrupt status */
          uint32_t doepint = stm32n6_getreg32(priv->base + STM32_OTG_DOEPINT_OFFSET(i));
          uint32_t doepmsk = stm32n6_getreg32(priv->base + STM32_OTG_DOEPMSK_OFFSET);

          usbvdbg("EP%d OUT intsts=%08x\n", i, doepint);

          if (doepint & doepmsk)
            {
              /* Clear interrupt flags */
              stm32n6_putreg32(doepint, priv->base + STM32_OTG_DOEPINT_OFFSET(i));

              if (doepint & (1 << 0))  /* Transfer complete */
                {
                  struct stm32n6_ep_s *privep = &priv->epout[i];

                  if (privep->head)
                    {
                      /* Complete the request */
                      stm32n6_rqcancel(privep, privep->head, 0);
                    }
                }
            }
        }
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int stm32n6_otgfs_initialize(void)
{
  struct stm32n6_usbdev_s *priv;
  uint32_t regval;
  int ret;
  int i;

  usbdbg("Initializing STM32N6 OTG FS\n");

  /* Get driver instance */
  priv = &g_otgdev;
  memset(priv, 0, sizeof(struct stm32n6_usbdev_s));

  /* Set base address */
  priv->base = STM32_OTGFS_BASE;

  /* Enable USB OTG clock */
  regval = getreg32(STM32_RCC_AHB2ENR);
  regval |= RCC_AHB2ENR_OTGFSEN;
  putreg32(regval, STM32_RCC_AHB2ENR);

  /* Configure pin control */
  stm32_configgpio(GPIO_OTG_FS_VBUS);
  stm32_configgpio(GPIO_OTG_FS_DM);
  stm32_configgpio(GPIO_OTG_FS_DP);
  stm32_configgpio(GPIO_OTG_FS_ID);
  stm32_configgpio(GPIO_OTG_FS_SOF);

  /* Reset the USB controller */
  regval = OTG_GRSTCTL_CSRST;
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GRSTCTL_OFFSET);

  /* Wait for reset to complete */
  while ((stm32n6_getreg32(priv->base + STM32_OTG_GRSTCTL_OFFSET) & OTG_GRSTCTL_CSRST) != 0);

  /* Wait for AHB master IDLE state */
  while ((stm32n6_getreg32(priv->base + STM32_OTG_GRSTCTL_OFFSET) & OTG_GRSTCTL_AHBIDL) == 0);

  /* Configure USB core */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_GUSBCFG_OFFSET);
  regval &= ~OTG_GUSBCFG_PHYSEL;  /* FS serial transceiver */
  regval |= OTG_GUSBCFG_SRPCAP;    /* SRP capability */
  regval |= OTG_GUSBCFG_HNPCAP;    /* HNP capability */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GUSBCFG_OFFSET);

  /* Configure core as device */
  regval = OTG_GUSBCFG_FDMOD | (0x6 << 10);  /* Force device mode, TRDT */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GUSBCFG_OFFSET);

  /* Configure power and clock gating */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_GCCFG_OFFSET);
  regval |= (1 << 23);  /* NoVBUSSENS */
  regval |= (1 << 21);  /* VBUSASEN */
  regval |= (1 << 20);  /* VBUSBSEN */
  regval |= (1 << 19);  /* SOFOUTEN */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GCCFG_OFFSET);

  /* Configure device mode */
  regval = OTG_DCFG_DSPD_FS_PHY_48MHZ;  /* Full-speed PHY */
  regval |= (3 << 2);  /* Periodic frame interval */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCFG_OFFSET);

  /* Clear device address */
  regval = stm32n6_getreg32(priv->base + STM32_OTG_DCFG_OFFSET);
  regval &= ~0x7F;  /* Clear address */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_DCFG_OFFSET);

  /* Flush TX and RX FIFOs */
  stm32n6_flush_rx(priv);
  for (i = 0; i < STM32N6_OTGFS_NENDPOINTS; i++)
    {
      stm32n6_flush_tx(priv, i);
    }

  /* Initialize FIFOs */
  stm32n6_initfifo(priv);

  /* Configure device interrupt mask */
  regval = OTG_GINTMSK_USBRST |    /* USB reset */
           OTG_GINTMSK_ENUMDNEM |  /* Enumeration done */
           OTG_GINTMSK_IEPINT |    /* IN endpoint interrupt */
           OTG_GINTMSK_OEPINT |    /* OUT endpoint interrupt */
           OTG_GINTMSK_RXFLVLM |   /* RX FIFO not empty */
           OTG_GINTMSK_WUIM |      /* Wakeup */
           OTG_GINTMSK_USBSUSPM;   /* USB suspend */
  stm32n6_putreg32(regval, priv->base + STM32_OTG_GINTMSK_OFFSET);

  /* Disable all endpoints */
  for (i = 0; i < STM32N6_OTGFS_NENDPOINTS; i++)
    {
      /* Disable IN endpoint */
      regval = stm32n6_getreg32(priv->base + STM32_OTG_DIEPCTL_OFFSET(i));
      regval &= ~OTG_DEPCTL_USBAEP;
      stm32n6_putreg32(regval, priv->base + STM32_OTG_DIEPCTL_OFFSET(i));

      /* Disable OUT endpoint */
      regval = stm32n6_getreg32(priv->base + STM32_OTG_DOEPCTL_OFFSET(i));
      regval &= ~OTG_DEPCTL_USBAEP;
      stm32n6_putreg32(regval, priv->base + STM32_OTG_DOEPCTL_OFFSET(i));
    }

  /* Enable USB interrupt */
  ret = irq_attach(STM32_IRQ_OTG_FS, stm32n6_usbinterrupt, priv);
  if (ret < 0)
    {
      usbdbg("Failed to attach OTG_FS IRQ\n");
      return ret;
    }

  up_enable_irq(STM32_IRQ_OTG_FS);

  /* Initialize endpoint structures */
  for (i = 0; i < STM32N6_OTGFS_NENDPOINTS; i++)
    {
      /* Initialize IN endpoint */
      priv->epin[i].dev = priv;
      priv->epin[i].epnum = i;
      priv->epin[i].ep.name = "in";
      priv->epin[i].ep.ops = &g_usbdev_ops;
      priv->epin[i].ep.priv = &priv->epin[i];

      /* Initialize OUT endpoint */
      priv->epout[i].dev = priv;
      priv->epout[i].epnum = i;
      priv->epout[i].ep.name = "out";
      priv->epout[i].ep.ops = &g_usbdev_ops;
      priv->epout[i].ep.priv = &priv->epout[i];
    }

  /* Initialize device structure */
  priv->usbdev.ops = &g_usbdev_ops;
  priv->usbdev.ep0 = &priv->epin[0].ep;

  /* Initialize state */
  priv->attached = 0;
  priv->suspended = 0;
  priv->selfpowered = 1;
  priv->addressed = 0;
  priv->configured = 0;

  /* Register with the USB device class */
  ret = usbdev_register(&priv->usbdev);
  if (ret < 0)
    {
      usbdbg("Failed to register USB device\n");
      return ret;
    }

  usbdbg("STM32N6 OTG FS initialized successfully\n");
  return OK;
}